xuos/xiuos_part/Ubiquitous/Nuttx_Fusion_XiUOS/app_match_nuttx/nuttx/arch/risc-v/src/k210/k210_uart_16550.c
/****************************************************************************
 * drivers/serial/uart_16550.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Serial driver for 16550 UART */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/serial/serial.h>
#include <nuttx/fs/ioctl.h>
#include "k210_uart_16550.h"

#ifdef CONFIG_SERIAL_TERMIOS
#  include <termios.h>
#endif

#ifdef CONFIG_K210_16550_UART


/****************************************************************************
 * Pre-processor definitions
 ****************************************************************************/

/****************************************************************************
 * Private Types
 ****************************************************************************/

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int  k210_16550_setup(FAR struct uart_dev_s *dev);
static void k210_16550_shutdown(FAR struct uart_dev_s *dev);
static int  k210_16550_attach(FAR struct uart_dev_s *dev);
static void k210_16550_detach(FAR struct uart_dev_s *dev);
static int  k210_16550_interrupt(int irq, FAR void *context, FAR void *arg);
static int  k210_16550_ioctl(FAR struct file *filep, int cmd, unsigned long arg);
static int  k210_16550_receive(FAR struct uart_dev_s *dev, unsigned int *status);
static void k210_16550_rxint(FAR struct uart_dev_s *dev, bool enable);
static bool k210_16550_rxavailable(FAR struct uart_dev_s *dev);
#ifdef CONFIG_SERIAL_IFLOWCONTROL
static bool k210_16550_rxflowcontrol(struct uart_dev_s *dev,
                                 unsigned int nbuffered, bool upper);
#endif
#ifdef CONFIG_SERIAL_TXDMA
static void k210_16550_dmasend(FAR struct uart_dev_s *dev);
static void k210_16550_dmatxavail(FAR struct uart_dev_s *dev);
#endif
#ifdef CONFIG_SERIAL_RXDMA
static void k210_16550_dmareceive(FAR struct uart_dev_s *dev);
static void k210_16550_dmarxfree(FAR struct uart_dev_s *dev);
#endif
static void k210_16550_send(FAR struct uart_dev_s *dev, int ch);
static void k210_16550_txint(FAR struct uart_dev_s *dev, bool enable);
static bool k210_16550_txready(FAR struct uart_dev_s *dev);
static bool k210_16550_txempty(FAR struct uart_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct uart_ops_s g_uart_ops =
{
  .setup          = k210_16550_setup,
  .shutdown       = k210_16550_shutdown,
  .attach         = k210_16550_attach,
  .detach         = k210_16550_detach,
  .ioctl          = k210_16550_ioctl,
  .receive        = k210_16550_receive,
  .rxint          = k210_16550_rxint,
  .rxavailable    = k210_16550_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = k210_16550_rxflowcontrol,
#endif
#ifdef CONFIG_SERIAL_TXDMA
  .dmasend        = k210_16550_dmasend,
#endif
#ifdef CONFIG_SERIAL_RXDMA
  .dmareceive     = k210_16550_dmareceive,
  .dmarxfree      = k210_16550_dmarxfree,
#endif
#ifdef CONFIG_SERIAL_TXDMA
  .dmatxavail     = k210_16550_dmatxavail,
#endif
  .send           = k210_16550_send,
  .txint          = k210_16550_txint,
  .txready        = k210_16550_txready,
  .txempty        = k210_16550_txempty,
};

/* I/O buffers */

#ifdef CONFIG_K210_16550_UART1
static char g_uart1rxbuffer[CONFIG_K210_16550_UART1_RXBUFSIZE];
static char g_uart1txbuffer[CONFIG_K210_16550_UART1_TXBUFSIZE];
#endif
#ifdef CONFIG_K210_16550_UART2
static char g_uart2rxbuffer[CONFIG_K210_16550_UART2_RXBUFSIZE];
static char g_uart2txbuffer[CONFIG_K210_16550_UART2_TXBUFSIZE];
#endif
#ifdef CONFIG_K210_16550_UART3
static char g_uart3rxbuffer[CONFIG_K210_16550_UART3_RXBUFSIZE];
static char g_uart3txbuffer[CONFIG_K210_16550_UART3_TXBUFSIZE];
#endif

/* This describes the state of the 16550 uart1 port. */

#ifdef CONFIG_K210_16550_UART1
static struct k210_16550_s g_uart1priv =
{
  .uartbase       = CONFIG_K210_16550_UART1_BASE,
#ifndef CONFIG_K210_16550_SUPRESS_CONFIG
  .baud           = CONFIG_K210_16550_UART1_BAUD,
  .uartclk        = CONFIG_K210_16550_UART1_CLOCK,
#endif
  .irq            = CONFIG_K210_16550_UART1_IRQ,
#ifndef CONFIG_K210_16550_SUPRESS_CONFIG
  .parity         = CONFIG_K210_16550_UART1_PARITY,
  .bits           = CONFIG_K210_16550_UART1_BITS,
  .stopbits2      = CONFIG_K210_16550_UART1_2STOP,
#if defined(CONFIG_K210_16550_UART1_IFLOWCONTROL) || defined(CONFIG_K210_16550_UART1_OFLOWCONTROL)
  .flow           = true,
#endif
#endif
};

static uart_dev_t g_uart1port =
{
  .recv     =
  {
    .size   = CONFIG_K210_16550_UART1_RXBUFSIZE,
    .buffer = g_uart1rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_K210_16550_UART1_TXBUFSIZE,
    .buffer = g_uart1txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart1priv,
};
#endif

