xuos/xiuos_part/Ubiquitous/Nuttx_Fusion_XiUOS/app_match_nuttx/nuttx/arch/risc-v/src/k210/k210_uart_16550.c
/* This describes the state of the 16550 uart2 port. */

#ifdef CONFIG_K210_16550_UART2
static struct k210_16550_s g_uart2priv =
{
  .uartbase       = CONFIG_K210_16550_UART2_BASE,
#ifndef CONFIG_K210_16550_SUPRESS_CONFIG
  .baud           = CONFIG_K210_16550_UART2_BAUD,
  .uartclk        = CONFIG_K210_16550_UART2_CLOCK,
#endif
  .irq            = CONFIG_K210_16550_UART2_IRQ,
#ifndef CONFIG_K210_16550_SUPRESS_CONFIG
  .parity         = CONFIG_K210_16550_UART2_PARITY,
  .bits           = CONFIG_K210_16550_UART2_BITS,
  .stopbits2      = CONFIG_K210_16550_UART2_2STOP,
#if defined(CONFIG_K210_16550_UART2_IFLOWCONTROL) || defined(CONFIG_K210_16550_UART2_OFLOWCONTROL)
  .flow           = true,
#endif
#endif
};

static uart_dev_t g_uart2port =
{
  .recv     =
  {
    .size   = CONFIG_K210_16550_UART2_RXBUFSIZE,
    .buffer = g_uart2rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_K210_16550_UART2_TXBUFSIZE,
    .buffer = g_uart2txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart2priv,
};

#endif

/* This describes the state of the 16550 uart1 port. */

#ifdef CONFIG_K210_16550_UART3
static struct k210_16550_s g_uart3priv =
{
  .uartbase       = CONFIG_K210_16550_UART3_BASE,
#ifndef CONFIG_K210_16550_SUPRESS_CONFIG
  .baud           = CONFIG_K210_16550_UART3_BAUD,
  .uartclk        = CONFIG_K210_16550_UART3_CLOCK,
#endif
  .irq            = CONFIG_K210_16550_UART3_IRQ,
#ifndef CONFIG_K210_16550_SUPRESS_CONFIG
  .parity         = CONFIG_K210_16550_UART3_PARITY,
  .bits           = CONFIG_K210_16550_UART3_BITS,
  .stopbits2      = CONFIG_K210_16550_UART3_2STOP,
#if defined(CONFIG_K210_16550_UART3_IFLOWCONTROL) || defined(CONFIG_K210_16550_UART3_OFLOWCONTROL)
  .flow           = true,
#endif
#endif
};

static uart_dev_t g_uart3port =
{
  .recv     =
  {
    .size   = CONFIG_K210_16550_UART3_RXBUFSIZE,
    .buffer = g_uart3rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_K210_16550_UART3_TXBUFSIZE,
    .buffer = g_uart3txbuffer,
  },
  .ops      = &g_uart_ops,
  .priv     = &g_uart3priv,
};

#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: k210_16550_serialin
 ****************************************************************************/

static inline uart_datawidth_t k210_16550_serialin(FAR struct k210_16550_s *priv,
                                               int offset)
{
#ifdef CONFIG_SERIAL_UART_ARCH_MMIO
  return *((FAR volatile uart_datawidth_t *)(priv->uartbase + offset));
#else
  return uart_getreg(priv->uartbase, offset);
#endif
}

/****************************************************************************
 * Name: k210_16550_serialout
 ****************************************************************************/

static inline void k210_16550_serialout(FAR struct k210_16550_s *priv, int offset,
                                    uart_datawidth_t value)
{
#ifdef CONFIG_SERIAL_UART_ARCH_MMIO
  *((FAR volatile uart_datawidth_t *)(priv->uartbase + offset)) = value;
#else
  uart_putreg(priv->uartbase, offset, value);
#endif
}

/****************************************************************************
 * Name: k210_16550_disableuartint
 ****************************************************************************/

static inline void k210_16550_disableuartint(FAR struct k210_16550_s *priv,
                                         FAR uart_datawidth_t *ier)
{
  if (ier)
    {
      *ier = priv->ier & UART_IER_ALLIE;
    }

  priv->ier &= ~UART_IER_ALLIE;
  k210_16550_serialout(priv, UART_IER_OFFSET, priv->ier);
}

/****************************************************************************
 * Name: k210_16550_restoreuartint
 ****************************************************************************/

static inline void k210_16550_restoreuartint(FAR struct k210_16550_s *priv,
                                         uint32_t ier)
{
  priv->ier |= ier & UART_IER_ALLIE;
  k210_16550_serialout(priv, UART_IER_OFFSET, priv->ier);
}

/****************************************************************************
 * Name: k210_16550_enablebreaks
 ****************************************************************************/

static inline void k210_16550_enablebreaks(FAR struct k210_16550_s *priv,
                                       bool enable)
{
  uint32_t lcr = k210_16550_serialin(priv, UART_LCR_OFFSET);

  if (enable)
    {
      lcr |= UART_LCR_BRK;
    }
  else
    {
      lcr &= ~UART_LCR_BRK;
    }

  k210_16550_serialout(priv, UART_LCR_OFFSET, lcr);
}

/****************************************************************************
 * Name: k210_16550_divisor
 *
 * Description:
 *   Select a divider to produce the BAUD from the UART_CLK.
 *
 *     BAUD = UART_CLK / (16 * DL), or
 *     DIV  = UART_CLK / BAUD / 16
 *
 *   Ignoring the fractional divider for now.
 *
 ****************************************************************************/

#ifndef CONFIG_K210_16550_SUPRESS_CONFIG
static inline uint32_t k210_16550_divisor(FAR struct k210_16550_s *priv)
{
  return (priv->uartclk / (uint32_t)priv->baud);
//  return (priv->uartclk + (priv->baud << 3)) / (priv->baud << 4);
}
#endif

/****************************************************************************
 * Name: k210_16550_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, fifos, etc. This
 *   method is called the first time that the serial port is
 *   opened.
 *
 ****************************************************************************/

static int k210_16550_setup(FAR struct uart_dev_s *dev)
{
#ifndef CONFIG_K210_16550_SUPRESS_CONFIG
  FAR struct k210_16550_s *priv = (FAR struct k210_16550_s *)dev->priv;
  uint16_t div;
  uint8_t dlh, dll, dlf;
  uint32_t lcr;
#if defined(CONFIG_SERIAL_IFLOWCONTROL) || defined(CONFIG_SERIAL_OFLOWCONTROL)
  uint32_t mcr;
#endif

  /* Clear fifos */

  k210_16550_serialout(priv, UART_FCR_OFFSET,
                   (UART_FCR_RXRST | UART_FCR_TXRST));

  /* Set trigger */

  k210_16550_serialout(priv, UART_FCR_OFFSET,
                   (UART_FCR_FIFOEN | UART_FCR_RXTRIGGER_8));

