xuos/xiuos_part/Ubiquitous/Nuttx_Fusion_XiUOS/app_match_nuttx/nuttx/arch/risc-v/src/k210/k210_uart_16550.c
  /* Set up the IER */

  priv->ier = k210_16550_serialin(priv, UART_IER_OFFSET);

  /* Set up the LCR */

  lcr = 0;
  switch (priv->bits)
    {
      case 5 :
        lcr |= UART_LCR_WLS_5BIT;
        break;

      case 6 :
        lcr |= UART_LCR_WLS_6BIT;
        break;

      case 7 :
        lcr |= UART_LCR_WLS_7BIT;
        break;

      default:
      case 8 :
        lcr |= UART_LCR_WLS_8BIT;
        break;
    }

  if (priv->stopbits2)
    {
      lcr |= UART_LCR_STB;
    }

  if (priv->parity == 1)
    {
      lcr |= UART_LCR_PEN;
    }
  else if (priv->parity == 2)
    {
      lcr |= (UART_LCR_PEN | UART_LCR_EPS);
    }

  /* Enter DLAB=1 */

  k210_16550_serialout(priv, UART_LCR_OFFSET, (lcr | UART_LCR_DLAB));

  /* Set the BAUD divisor */

  div = k210_16550_divisor(priv);
  dlh = div >> 12;
  dll = (div - (dlh << 12)) / 16;
  dlf = div - (dlh << 12) - dll * 16;

  k210_16550_serialout(priv, UART_DLM_OFFSET, dlh);
  k210_16550_serialout(priv, UART_DLL_OFFSET, dll);
  k210_16550_serialout(priv, UART_DLF_OFFSET, dlf);

  /* Clear DLAB */

  k210_16550_serialout(priv, UART_LCR_OFFSET, lcr);

  /* Configure the FIFOs */

  k210_16550_serialout(priv, UART_FCR_OFFSET,
                   (UART_FCR_RXTRIGGER_8 | UART_FCR_TXRST | UART_FCR_RXRST |
                    UART_FCR_FIFOEN));

  /* Set up the auto flow control */

#if defined(CONFIG_SERIAL_IFLOWCONTROL) || defined(CONFIG_SERIAL_OFLOWCONTROL)
  mcr = k210_16550_serialin(priv, UART_MCR_OFFSET);
  if (priv->flow)
    {
      mcr |= UART_MCR_AFCE;
    }
  else
    {
      mcr &= ~UART_MCR_AFCE;
    }

  mcr |= UART_MCR_RTS;

  k210_16550_serialout(priv, UART_MCR_OFFSET, mcr);

  k210_16550_serialout(priv, UART_SRT_OFFSET, 0x0);

#endif /* defined(CONFIG_SERIAL_IFLOWCONTROL) || defined(CONFIG_SERIAL_OFLOWCONTROL) */

#endif
  return OK;
}

/****************************************************************************
 * Name: k210_16550_shutdown
 *
 * Description:
 *   Disable the UART.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

static void k210_16550_shutdown(struct uart_dev_s *dev)
{
  FAR struct k210_16550_s *priv = (FAR struct k210_16550_s *)dev->priv;
  k210_16550_disableuartint(priv, NULL);
}

/****************************************************************************
 * Name: k210_16550_attach
 *
 * Description:
 *   Configure the UART to operation in interrupt driven mode.  This method
 *   is called when the serial port is opened.  Normally, this is just after
 *   the setup() method is called, however, the serial console may operate in
 *   a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless
 *   the hardware supports multiple levels of interrupt enabling).  The RX
 *   and TX interrupts are not enabled until the txint() and rxint() methods
 *   are called.
 *
 ****************************************************************************/

static int k210_16550_attach(struct uart_dev_s *dev)
{
  FAR struct k210_16550_s *priv = (FAR struct k210_16550_s *)dev->priv;
  int ret;

  /* Attach and enable the IRQ */

  ret = irq_attach(priv->irq, k210_16550_interrupt, dev);
#ifndef CONFIG_ARCH_NOINTC
  if (ret == OK)
    {
      /* Enable the interrupt (RX and TX interrupts are still disabled
       * in the UART
       */

      up_enable_irq(priv->irq);
    }
#endif

  return ret;
}

/****************************************************************************
 * Name: k210_16550_detach
 *
 * Description:
 *   Detach UART interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.
 *   The exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void k210_16550_detach(FAR struct uart_dev_s *dev)
{
  FAR struct k210_16550_s *priv = (FAR struct k210_16550_s *)dev->priv;

  up_disable_irq(priv->irq);
  irq_detach(priv->irq);
}

/****************************************************************************
 * Name: k210_16550_interrupt
 *
 * Description:
 *   This is the UART interrupt handler.  It will be invoked when an
 *   interrupt received on the 'irq'  It should call uart_transmitchars or
 *   uart_receivechar to perform the appropriate data transfers.  The
 *   interrupt handling logic must be able to map the 'irq' number into the
 *   appropriate k210_16550_s structure in order to call these functions.
 *
 ****************************************************************************/

static int k210_16550_interrupt(int irq, FAR void *context, FAR void *arg)
{
  FAR struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  FAR struct k210_16550_s *priv;
  uint32_t status;
  int passes;
  uint8_t v_int_status;

  DEBUGASSERT(dev != NULL && dev->priv != NULL);
  priv = (FAR struct k210_16550_s *)dev->priv;

  /* Loop until there are no characters to be transferred or,
   * until we have been looping for a long time.
   */

  for (passes = 0; passes < 256; passes++)
    {
      /* Get the current UART status and check for loop
       * termination conditions
       */

      status = k210_16550_serialin(priv, UART_IIR_OFFSET);

      if (status == 0)
      {
        break;
      }
      v_int_status = status & 0xF;

      /* The UART_IIR_INTSTATUS bit should be zero if there are pending
       * interrupts
       */
      if(v_int_status == UART_INTERRUPT_SEND)
      {
        uart_xmitchars(dev);
        break;
      }

      else if (v_int_status == UART_INTERRUPT_RECEIVE || v_int_status == UART_INTERRUPT_CHARACTER_TIMEOUT)
      {
        uart_recvchars(dev);
        break;
      }
    }

  return OK;
}

/****************************************************************************
 * Name: k210_16550_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int k210_16550_ioctl(struct file *filep, int cmd, unsigned long arg)
{
  FAR struct inode *inode    = filep->f_inode;
  FAR struct uart_dev_s *dev = inode->i_private;
  FAR struct k210_16550_s *priv  = (FAR struct k210_16550_s *)dev->priv;
  int ret;

