xuos/xiuos_part/Ubiquitous/Nuttx_Fusion_XiUOS/app_match_nuttx/nuttx/arch/risc-v/src/k210/k210_uart_16550.c
  return false;
}
#endif

/****************************************************************************
 * Name: k210_16550_dma*
 *
 * Description:
 *   Stub functions used when serial DMA is enabled.
 *
 ****************************************************************************/

#ifdef CONFIG_SERIAL_TXDMA
static void k210_16550_dmasend(FAR struct uart_dev_s *dev)
{
}
#endif

#ifdef CONFIG_SERIAL_RXDMA
static void k210_16550_dmareceive(FAR struct uart_dev_s *dev)
{
}

static void k210_16550_dmarxfree(FAR struct uart_dev_s *dev)
{
}
#endif

#ifdef CONFIG_SERIAL_TXDMA
static void k210_16550_dmatxavail(FAR struct uart_dev_s *dev)
{
}
#endif

/****************************************************************************
 * Name: k210_16550_send
 *
 * Description:
 *   This method will send one byte on the UART
 *
 ****************************************************************************/

static void k210_16550_send(struct uart_dev_s *dev, int ch)
{
  FAR struct k210_16550_s *priv = (FAR struct k210_16550_s *)dev->priv;
  k210_16550_serialout(priv, UART_THR_OFFSET, (uart_datawidth_t)ch);
}

/****************************************************************************
 * Name: k210_16550_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts
 *
 ****************************************************************************/

static void k210_16550_txint(struct uart_dev_s *dev, bool enable)
{
  FAR struct k210_16550_s *priv = (FAR struct k210_16550_s *)dev->priv;
  irqstate_t flags;

  flags = enter_critical_section();
  if (enable)
    {
      priv->ier |= UART_IER_ETBEI;
      k210_16550_serialout(priv, UART_IER_OFFSET, priv->ier);

      /* Fake a TX interrupt here by just calling uart_xmitchars() with
       * interrupts disabled (note this may recurse).
       */

      uart_xmitchars(dev);
    }
  else
    {
      priv->ier &= ~UART_IER_ETBEI;
      k210_16550_serialout(priv, UART_IER_OFFSET, priv->ier);
    }

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: k210_16550_txready
 *
 * Description:
 *   Return true if the tranmsit fifo is not full
 *
 ****************************************************************************/

static bool k210_16550_txready(struct uart_dev_s *dev)
{
  FAR struct k210_16550_s *priv = (FAR struct k210_16550_s *)dev->priv;
  return (((k210_16550_serialin(priv, UART_LSR_OFFSET) & UART_LSR_THRE) != 0));
}

/****************************************************************************
 * Name: k210_16550_txempty
 *
 * Description:
 *   Return true if the transmit fifo is empty
 *
 ****************************************************************************/

static bool k210_16550_txempty(struct uart_dev_s *dev)
{
  FAR struct k210_16550_s *priv = (FAR struct k210_16550_s *)dev->priv;
  return ((k210_16550_serialin(priv, UART_LSR_OFFSET) & UART_LSR_TEMT) != 0);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
 
/****************************************************************************
 * Name: k210_uart_16550_register
 *
 * Description:
 *   Register serial console and serial ports.  This assumes that
 *   up_earlyserialinit was called previously.
 *
 ****************************************************************************/

void k210_uart_16550_register(void)
{
#if defined(CONFIG_K210_16550_UART1)
    k210_16550_setup(&g_uart1port);
    uart_register("/dev/ttyS1", &g_uart1port);
#endif
#if defined(CONFIG_K210_16550_UART2)
    k210_16550_setup(&g_uart2port);
    uart_register("/dev/ttyS2", &g_uart2port);
#endif
#if defined(CONFIG_K210_16550_UART3)
    k210_16550_setup(&g_uart3port);
    uart_register("/dev/ttyS3", &g_uart3port);
#endif
}

#endif /* CONFIG_K210_16550_UART */
